In [12]:
import pandas as pd
#Creación de los DFs

df1 = pd.DataFrame(
    #Diccionario para transf en el df1
    {
    'Salario':[30000,450000,380000],
    'Antiguedad':[9,12,13]},
    
    #índices del df1            
    index = [1,2,3]
)


df2 = pd.DataFrame(
    #Diccionario para transf en el df1
    {
    'Ciudad':['Madrid','Barcelona','Valencia'],
    'Jerarquía':['Baja','Alta','Media']}, 
    
     #índices del df1  
     index = [1,2,4]
)

In [9]:
df1

   Salario  Antiguedad
1    30000           9
2   450000          12
3   380000          13

In [10]:
df2

      Ciudad Jerarquía
1     Madrid      Baja
2  Barcelona      Alta
4   Valencia     Media

In [11]:
df_unido = df1.join(df2)#Para unir estos dos DF solo le metemos el join y le pasamos el parámetro que sería el DF con el que queremos que se una
df_unido

   Salario  Antiguedad     Ciudad Jerarquía
1    30000           9     Madrid      Baja
2   450000          12  Barcelona      Alta
3   380000          13        NaN       NaN

Como vemos arriba la fn join deja el df1 del lado izq y solo trae algunas del derecho, pq? bueno pq
esta fn está conf de default digamos con el how = 'left', aún así esto lo podemos cambiar y personalizar nosotro, asi...

In [17]:
#how = outer
df_unido = df1.join(df2,how = 'outer')#Como lo q hace ac'a el outer es lo que hace siempre, juntar todo y en lo que falte meter NaN
df_unido

    Salario  Antiguedad     Ciudad Jerarquía
1   30000.0         9.0     Madrid      Baja
2  450000.0        12.0  Barcelona      Alta
3  380000.0        13.0        NaN       NaN
4       NaN         NaN   Valencia     Media

In [18]:
#how = inner
df_unido = df1.join(df2,how = 'inner')#En el inner solo arma el df con las partes que coincide osea con los índices
df_unido

   Salario  Antiguedad     Ciudad Jerarquía
1    30000           9     Madrid      Baja
2   450000          12  Barcelona      Alta

In [21]:
#how =  right
df_unido = df1.join(df2,how = 'right')#Es la inversa que con el left... deja el la parte derecha y trae algunas de las que coincide de la izq
df_unido

    Salario  Antiguedad     Ciudad Jerarquía
1   30000.0         9.0     Madrid      Baja
2  450000.0        12.0  Barcelona      Alta
4       NaN         NaN   Valencia     Media

Claramente al ser join() ya trabaja con los índices desde un principio, a si que acá no se usa ni el left_index ni el right_...